erp3l/src/Catalogs/НастройкиИмпортаФайлаИзФНС/НастройкиИмпортаФайлаИзФНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиИмпортаФайлаИзФНС</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеПоказателейИПолей</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>EnumRef.ПорядкиОкругленияОтчетности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецПоля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательОтчета</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяАтрибутом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>xPathПуть</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/НастройкиИмпортаФайлаИзФНС/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПРЕОБРАЗОВАНИЯ ТАБЛИЧНОЙ ЧАСТИ В ДЕРЕВО ЗНАЧЕНИЙ.
//

Функция ВернутьДеревоСтруктуры(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.КодПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.НаименованиеПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ВладелецПоля КАК ВладелецПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ПоказательОтчета,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ЯвляетсяАтрибутом КАК ЯвляетсяАтрибутом,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Кратность = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1)
	|		ИНАЧЕ НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Кратность
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	Справочник.НастройкиИмпортаФайлаИзФНС.СоответствиеПоказателейИПолей КАК НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей
	|ГДЕ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВладелецПоля,
	|	ЯвляетсяАтрибутом УБЫВ
	|ИТОГИ ПО
	|	ВладелецПоля";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("КодПоля");
	ДеревоСтруктуры.Колонки.Добавить("НаименованиеПоля");
	ДеревоСтруктуры.Колонки.Добавить("ПоказательОтчета");
	ДеревоСтруктуры.Колонки.Добавить("ЯвляетсяАтрибутом");
	ДеревоСтруктуры.Колонки.Добавить("Кратность");
	
	ЗаполнитьВетвьДерева(ДеревоСтруктуры, 0, ДеревоЗначений);
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

Процедура ПолучитьНастроенныеАтрибуты(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Номер,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ВладелецПоля,
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.КодПоля
	|ИЗ
	|	Справочник.НастройкиИмпортаФайлаИзФНС.СоответствиеПоказателейИПолей КАК НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ПО НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ПоказательОтчета = ПоказателиОтчетов.Ссылка
	|ГДЕ
	|	НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.Ссылка = &Ссылка
	|	И НастройкиИмпортаФайлаИзФНССоответствиеПоказателейИПолей.ЯвляетсяАтрибутом = ИСТИНА"
	
КонецПроцедуры

Процедура ЗаполнитьВетвьДерева(ВетвьДереваСтруктуры, Знач ИндексВладельца, ДеревоЗначений);
	
	ТекущееПоле = ДеревоЗначений.Строки.Найти(ИндексВладельца, "ВладелецПоля");
	Если ТекущееПоле <> Неопределено Тогда
		Для Каждого Элемент Из ТекущееПоле.Строки Цикл
			
			НоваяСтрока = ВетвьДереваСтруктуры.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
			ЗаполнитьВетвьДерева(НоваяСтрока, Элемент.Номер, ДеревоЗначений);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
